_posts/2022-08-05-small_emacs_lisp_debugging_tips.html
---
layout: blogpost
title: Emacs Lisp debugging tips
tags: emacs
---

<p>
Have you ever gotten weird errors in an Emacs Lisp package? Something like "wrong type argument" or similar shown in the minibuffer? At first glance, these seem kind of cryptic. Where do they come from? Can I get a stack trace? What arguments are functions called with? Today I will show you how to answer these questions!
</p>



<div id="outline-container-orgf41cfe1" class="outline-2">
<h2 id="orgf41cfe1">Show stack traces</h2>
<div class="outline-text-2" id="text-orgf41cfe1">
<p>
You have probably gotten one of those weird "wrong type argument" errors, or similar errors just printed in the minibuffer before. You have probably also navigated to the <code>*Messages*</code>-buffer to check if there is any additional information. Did you know you can see a stack trace instead? Then you can see the functions being called leading up to the error!
</p>


<p>
There are several ways to activate it. The most common way is to just set Emacs to enter the debugger when an error happen. You can do this by setting the variable <code>debug-on-error</code>
 to true (either in your config or just executing it right in your scratch buffer):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq debug-on-error t)
</pre>
</div>

<p>
I usually prefer to turn it on by need using M-x instead, <code>M-x toggle-debug-on-error</code>.
</p>


<p>
Let's show a quick example using a function from <a href="https://github.com/emacs-lsp/lsp-mode">the lsp-mode codebase</a>. Experienced programmers will probably notice the issue right away, but let's see how we will debug it. We are going to assume that we have gotten a hash table that we want to fetch results from called <code>result-data</code>. Running it in the scratch buffer will always show a stack trace, so let's make an interactive function we will call using M-x:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(defun my-lsp-mode-fun ()
  (interactive)
  (let* ((my-key "key")
	 (my-data (lsp-get result-data my-key)))
    ;; ... do something with the data ...
    ))
</pre>
</div>

<p>
If we call it without turning on debug-on-error, we will see the error <code>Wrong type argument: symbolp, "key"</code> in the minibuffer and messages-buffer. Some of you will probably already see that it expects a symbol, not a string. It will be even more clear if you turn on debug-on-error and running it again:
</p>

<div class="org-src-container">
<pre class="src src-text">Debugger entered--Lisp error: (wrong-type-argument symbolp "key")
  symbol-name("key")
  lsp-keyword-&gt;string("key")
  lsp-get(#&lt;hash-table equal 0/65 0x47fa6ca9&gt; "key")
  (let* ((my-key "key") (my-data (lsp-get result-data my-key))))
  my-lsp-mode-fun()
  funcall-interactively(my-lsp-mode-fun)
  call-interactively(my-lsp-mode-fun record nil)
  command-execute(my-lsp-mode-fun record)
  helm-M-x-execute-command(my-lsp-mode-fun)
  helm-execute-selection-action-1()
  helm-execute-selection-action()
  helm-internal((((name . "Emacs Commands history") ...truncated....
  helm-M-x(nil)
  funcall-interactively(helm-M-x nil)
  call-interactively(helm-M-x nil nil)
  command-execute(helm-M-x)

</pre>
</div>
<p>
(some data are truncated for better readability by me)
</p>

<p>
You see that we get a stack trace of all operations that is done by Emacs. Even if you are not making packages yourself, this can prove very useful to provide information in issue trackers when reporting issues (e.g, on the packages Github repo).
</p>


<p>
There are several other ways to toggle errors, ranging from message patterns to signals. You can read more about that <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Error-Debugging.html">on the documentation pages</a>.
</p>
</div>
</div>


<div id="outline-container-org93ba1b9" class="outline-2">
<h2 id="org93ba1b9">Tracing function invocations</h2>
<div class="outline-text-2" id="text-org93ba1b9">
<p>
Another useful troubleshooting tips to know is tracing function invocations/calls. Sometimes we just want to see what arguments a specific function is called with, and be notified about it each time it is run. This is done with the <code>trace-function</code> command (<code>M-x trace-function</code>, followed by the name of the function you want to trace). 
</p>


<p>
Let's reuse the code example from above and trace lsp-get. After calling our interactive function once, we will then see a buffer called <code>*trace-output*</code> with data like this:
</p>

<div class="org-src-container">
<pre class="src src-text">======================================================================
1 -&gt; (lsp-get #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ()) "key")
1 &lt;- lsp-get: !non-local\ exit!

</pre>
</div>

<p>
Calling it more times will populate the buffer with more data. You can trace as many functions as you want. When you are done tracing a function, you can call <code>untrace-function</code> and choose the function you want to stop tracing.
</p>



<p>
I find this super useful when developing packages. When calling a function external to your package (i.e, from another package or built-in to Emacs Lisp), it's very useful to be able to trace how functions behave. This includes when, or if, they are called, as well as with what arguments.
</p>
</div>
</div>
